// 考虑到环境导致的行为差异太大，应该避免在块级作用域内声明函数。
// 如果确实需要，也应该写成函数表达式，而不是函数声明语句。

/*===========================================*/
// 函数声明语句
/*===========================================*/
{
    let a = '函数声明语句';

    function f() {
        return a;
    }
}
// 私有
console.log(f());


/*===========================================*/
// 函数表达式
/*===========================================*/
// 推荐用下面的这种方式声明语句
{
    let a = '函数表达式'
    let letf = function () {
        return a;
    }
}


// ReferenceError: letf is not defined
console.log(letf());


















